<h3 align = 'center'> Data Frame </h3>

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types.  
You can think of it like a spreadsheet or SQL table, or a dict of Series objects.   
It is generally the most commonly used pandas object.  
DataFrame accepts many different kinds of input for example:  

- Dict of 1D ndarrays, lists, dicts, or Series  
- 2-D numpy.ndarray  
- Structured or record ndarray  
- A Series  
- Another DataFrame

In [66]:
import numpy as np
import pandas as pd

In [67]:
#constructin dataframe from a dictiionary
d = {'col1': [1,2,3], 'col2': [4,5,6]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     4
1     2     5
2     3     6

In [68]:
#dataframe has an argument called dtype.
#it is used to force the datatype of columns and only a single 
#datatype can be used. If it is not specified, pandas will infer the
#datatype by itself. For example, in the above case the infered datatype 
#is int64
df.dtypes

col1    int64
col2    int64
dtype: object

In [69]:
#to enforce a single datatype
df = pd.DataFrame(data=d, dtype=np.int8)
df.dtypes

col1    int8
col2    int8
dtype: object

In [70]:
#constructing dataframe from nd-array
df2 = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]), 
                   columns=['a', 'b', 'c'])
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [71]:
#constructing dataframe from dataclass
from dataclasses import make_dataclass
Point = make_dataclass('Point', [('x', int), ('y', int)])
pd.DataFrame([Point(0,0), Point(0,3), Point(2,3)])

   x  y
0  0  0
1  0  3
2  2  3

Dataframe have tons of methods and functions which can be used to do almost anything with data in hand.  
We will be adding those functionalities every now and then in the coming sessions.

### loc and iloc functions in dataframe

In [72]:
#loc is label-based, which means that we have to specify the name of the rows and columns that we need to filter out.
#example
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

In [73]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [74]:
#Lets play with this dataframe

#select rows where value of age is greater than 15
data.loc[data.age > 15]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
3   21       B   Delhi      M             NaN
6   17       A  Mumbai      F             red

In [75]:
#multiple conditions can also be used 
#for example, find rows with age greater than or equal to 12 and gender is male.
data.loc[(data.age>=12) & (data.gender=='M')]

   age section    city gender favourite_color
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black

In [76]:
#slice data over a range of indice using loc
data.loc[1:3]
#note: if indices are not sorted the above code will only return 1 and 3
#note: if the indices are not numbers then we can't use loc. rather we use iloc.

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
2   13       C  Mumbai      F          yellow
3   21       B   Delhi      M             NaN

In [77]:
#select fewer columns with a condition
data.loc[(data.age>=12), ['city', 'gender']]

     city gender
1   Delhi      F
2  Mumbai      F
3   Delhi      M
4  Mumbai      M
6  Mumbai      F

In [78]:
#we often need to update the values in our dataset based on certain condition.
#for example if the values of age are greater than 12 we want the section column to be 'M'

data.loc[(data.age >=12), ['section']] = 'M'
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       M    Delhi      F             NaN
2   13       M   Mumbai      F          yellow
3   21       M    Delhi      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

In [79]:
#we can also update the values of multiple columns on selected rows.
#example
data.loc[(data.age>=20), ['section', 'city']] = ['S', 'Pune']
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       M   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

### Select rows with indices using iloc

In [80]:
#when using iloc, we select rows and columns by using their integer indices
#in the example above, we are selecting rown 1 and 3rd.
#simply put this into a list in iloc statment.
data.iloc[[0,2]]

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       M   Mumbai      F          yellow

In [81]:
#selecting rows and columns using iloc.
#earlier we selected rows and columns with loc. Now we use the same with iloc.
#remember that we only need to put the index number of column rather than name.

data.iloc[[0,1,2], [1,3]]

  section gender
0       A      M
1       S      F
2       M      F

In [82]:
#we can use slices as well, to select range of rows and columns
data.iloc[0:3, 0:3]

   age section     city
0   10       A  Gurgaon
1   22       S     Pune
2   13       M   Mumbai

### Other Dataframe Functions

In [83]:
data.describe() #getting some statistical data about dataframe.

             age
count   7.000000
mean   15.142857
std     4.879500
min    10.000000
25%    11.500000
50%    13.000000
75%    19.000000
max    22.000000

In [84]:
data.shape #Getting shape of dataframe. i.e 7 row and 5 columns

(7, 5)

In [85]:
data.info() #index and columns datatype and no of non null values etc.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              7 non-null      int64
 1   section          7 non-null      object
 2   city             7 non-null      object
 3   gender           7 non-null      object
 4   favourite_color  5 non-null      object
dtypes: int64(1), object(4)
memory usage: 408.0+ bytes

In [86]:
data.nlargest(3, 'age') #return 3 rows ordered by age in descending order.

   age section    city gender favourite_color
1   22       S    Pune      F             NaN
3   21       S    Pune      M             NaN
6   17       M  Mumbai      F             red

In [87]:
data.columns #gives you column names

Index(['age', 'section', 'city', 'gender', 'favourite_color'], dtype='object')

In [88]:
data['city'].count() #returns count of the values in specified column

7

In [89]:
data.count() #retrun count of values in every column

age                7
section            7
city               7
gender             7
favourite_color    5
dtype: int64

In [90]:
data.drop(['city'], axis = 1) #drops the specified column

   age section gender favourite_color
0   10       A      M             red
1   22       S      F             NaN
2   13       M      F          yellow
3   21       S      M             NaN
4   12       M      M           black
5   11       A      M           green
6   17       M      F             red

### Other Selection Techniques

In [91]:
data['age'] #retruns series with column label

0    10
1    22
2    13
3    21
4    12
5    11
6    17
Name: age, dtype: int64

In [92]:
data[['age', 'gender']] #retrun new dataframe with specified columns

   age gender
0   10      M
1   22      F
2   13      F
3   21      M
4   12      M
5   11      M
6   17      F

In [93]:
data.iloc[0] #selection by position

age                     10
section                  A
city               Gurgaon
gender                   M
favourite_color        red
Name: 0, dtype: object

In [94]:
data.loc[[0]] #selection by index

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red

In [95]:
 data.iloc[0,:] #first row

age                     10
section                  A
city               Gurgaon
gender                   M
favourite_color        red
Name: 0, dtype: object

In [96]:
df.iloc[0,1] #first element of the first column

4

In [97]:
data.iloc[lambda x: x.index%2==0] #retrun records with even indices

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       M   Mumbai      F          yellow
4   12       M   Mumbai      M           black
6   17       M   Mumbai      F             red

In [98]:
data.iloc[[0, 2], [1, 3]] #first list contain indices you want to retrun. second contain column indices of your interest

  section gender
0       A      M
2       M      F

### Filter, Sort and Groupby

Lets make new dataframes which will be used in this exercise.

In [99]:
dic1 = {'col1': [1,2,3], 'col2': [4,5,6]}
df1 = pd.DataFrame(data=dic1)
print(df1)

dic2 = {'col1': [7,8,9], 'col2': [10,11,6]}
df2 = pd.DataFrame(data=dic2)
print(df2)

   col1  col2
0     1     4
1     2     5
2     3     6
   col1  col2
0     7    10
1     8    11
2     9     6

In [100]:
df1[df1['col1']>1] #retruns those rows which have values greater than 1 in col1

   col1  col2
1     2     5
2     3     6

In [101]:
df1[(df1['col1']>1) & (df1['col2']<7)] #used with and operator

   col1  col2
1     2     5
2     3     6

In [102]:
df1.sort_values('col1', ascending=False) #sort values according to col1 in descending order

   col1  col2
2     3     6
1     2     5
0     1     4

In [103]:
df1.sort_values(['col1', 'col2'], ascending=[False, True]) #Sort values by col1 in ascending order then col2 in descending order

   col1  col2
2     3     6
1     2     5
0     1     4

In [106]:
df1.apply(np.mean) #retrun mean of every column

col1    2.0
col2    5.0
dtype: float64

In [108]:
#Append/Combine
df1.append(df2) #Add the rows in df1 to the end of df2 (columns should be identical)

   col1  col2
0     1     4
1     2     5
2     3     6
0     7    10
1     8    11
2     9     6

In [112]:
pd.concat([df1, df2], axis=1) #Add the columns in df1 to the end of df2 (rows should be identical)
                              #Will add by rows if axis = 0

   col1  col2  col1  col2
0     1     4     7    10
1     2     5     8    11
2     3     6     9     6